-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2021 年 02 月 07 日 20:13
-- 伺服器版本： 10.4.17-MariaDB
-- PHP 版本： 7.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `bmo`
--

-- --------------------------------------------------------

--
-- 資料表結構 `class_sub`
--

CREATE TABLE `class_sub` (
  `sub_id` int(3) NOT NULL,
  `sub_sort` int(2) NOT NULL,
  `main_id` int(2) NOT NULL,
  `sub_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `class_sub`
--

INSERT INTO `class_sub` (`sub_id`, `sub_sort`, `main_id`, `sub_name`) VALUES
(1, 0, 1, '現代華文創作'),
(2, 1, 1, '現代詩'),
(3, 2, 1, '旅行飲食／自然文學'),
(4, 3, 1, '現代翻譯文學'),
(5, 4, 1, '推理／犯罪小說'),
(6, 5, 1, '恐怖／驚悚小說'),
(7, 6, 1, '奇幻／科幻小說'),
(8, 7, 1, '歷史／武俠小說'),
(9, 8, 1, '愛情小說'),
(10, 0, 2, '領導／管理'),
(11, 0, 2, '傳記／實例'),
(12, 0, 2, '管理實務'),
(13, 0, 2, '投資理財'),
(14, 0, 2, '職場工作術'),
(15, 0, 2, '創業／電商'),
(16, 0, 2, '行銷／業務'),
(17, 0, 3, '手作設計'),
(18, 0, 3, '影視娛樂'),
(19, 0, 3, '戶外活動／運動'),
(20, 0, 3, '美妝／時尚'),
(21, 0, 3, '品味／指南'),
(22, 0, 4, '烘焙／點心'),
(23, 2, 4, '主題料理'),
(24, 1, 4, '飲品／冰品'),
(25, 3, 4, '飲食生活'),
(26, 4, 4, '各國料理'),
(27, 0, 5, '自我成長'),
(28, 0, 5, '勵志小品'),
(29, 0, 5, '人性／人際'),
(30, 0, 5, '家庭／兩性'),
(31, 0, 5, '心理諮商／治療'),
(32, 0, 5, '人格天賦／潛能開發'),
(33, 0, 6, '健康飲食'),
(34, 0, 6, '懷孕／育兒'),
(35, 0, 6, '減肥／塑身'),
(36, 0, 6, '健康觀念'),
(37, 0, 6, '疾病百科'),
(38, 0, 6, '舒壓／養生'),
(39, 0, 7, '日本'),
(40, 0, 7, '亞洲'),
(41, 0, 7, '台灣旅遊'),
(42, 0, 7, '世界旅遊'),
(43, 0, 7, '中國'),
(44, 0, 7, '歐洲'),
(45, 0, 7, '美洲'),
(46, 0, 7, '大洋洲'),
(47, 0, 7, '非洲'),
(48, 0, 8, '佛教'),
(49, 0, 8, '基督教'),
(50, 0, 8, '占星／血型'),
(51, 0, 8, '占卜'),
(52, 0, 8, '命理'),
(53, 0, 8, '曆書'),
(54, 0, 8, '其他宗教'),
(55, 6, 9, 'APP開發／程式設計'),
(56, 7, 9, '辦公軟體／應用軟體'),
(57, 3, 9, '資料庫／大數據'),
(58, 1, 9, '網頁開發'),
(59, 2, 9, '網路／架站'),
(60, 4, 9, '工程／3D繪圖'),
(61, 5, 9, '遊戲／數位生活'),
(62, 0, 9, '認證考試'),
(63, 0, 10, '女性時尚'),
(64, 1, 10, '男性時尚'),
(65, 0, 11, '偶像藝人'),
(66, 0, 11, '次文化'),
(67, 0, 12, '0-3歲嬰幼兒'),
(68, 0, 12, '親子教養'),
(69, 0, 12, '親子生活'),
(70, 0, 13, '寶寶書(0-3)'),
(71, 0, 13, '遊戲本'),
(72, 0, 13, '塗鴉／貼紙／黏土'),
(73, 0, 14, '古代羅曼史'),
(74, 0, 14, ' 現代羅曼史'),
(75, 0, 15, '奇幻／科幻輕小說'),
(76, 0, 15, '推理／神怪輕小說'),
(77, 0, 15, '玄幻／仙俠輕小說'),
(78, 0, 16, '戀愛關係'),
(79, 0, 16, '魔幻冒險'),
(80, 0, 17, '英語學習'),
(81, 0, 17, '英語檢定'),
(82, 0, 18, '建築／室內設計'),
(83, 0, 18, ' 攝影'),
(84, 0, 19, '植物／花草生活'),
(85, 0, 19, '動物／寵物'),
(86, 0, 20, '台灣史地'),
(87, 0, 20, '亞洲史地'),
(88, 0, 21, '社會議題'),
(89, 0, 21, '政治／國際情勢'),
(90, 0, 22, '研究所考試'),
(91, 0, 22, ' 升大學／插大'),
(92, 0, 23, '高中學測'),
(93, 0, 23, '高中指考'),
(94, 0, 25, '各國文學'),
(95, 1, 25, '類型文學'),
(96, 0, 27, '女性時尚'),
(97, 0, 27, '男性時尚');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `class_sub`
--
ALTER TABLE `class_sub`
  ADD PRIMARY KEY (`sub_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `class_sub`
--
ALTER TABLE `class_sub`
  MODIFY `sub_id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=98;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
